R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int f0/0
R1(config-if)#ip address 192.168.4.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#
*Mar  1 00:02:08.095: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:02:09.095: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R1(config-if)#exit
R1(config)#int s0/0
R1(config-if)#ip address 192.168.2.1 255.255.255.0
R1(config-if)#no shut
R1(config-if)#
*Mar  1 00:02:55.439: %LINK-3-UPDOWN: Interface Serial0/0, changed state to up
*Mar  1 00:02:56.439: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to up
R1(config-if)#exit
R1(config)#ip dhcp pool p4
*Mar  1 00:03:22.603: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to down
R1(config)#ip dhcp pool p4
R1(dhcp-config)#network 192.168.4.0 255.255.255.0
R1(dhcp-config)#default-router 192.168.4.1
R1(dhcp-config)#exit
R1(config)#exit
R1#
*Mar  1 00:04:55.695: %SYS-5-CONFIG_I: Configured from console by console
R1#wr
Building configuration...
[OK]
R1#
*Mar  1 00:15:02.595: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to up
R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.4.0/24 is directly connected, FastEthernet0/0
C    192.168.2.0/24 is directly connected, Serial0/0
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router ospf 1
R1(config-router)#network 192.168.4.0 0.0.0.255 area 0
R1(config-router)#network 192.168.2.0 0.0.0.255 area 0
R1(config-router)#exit
R1(config)#exit
R1#
*Mar  1 00:28:05.043: %SYS-5-CONFIG_I: Configured from console by console
R1#wr
Building configuration...
[OK]
R1#
*Mar  1 00:32:40.779: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.3.2 on Serial0/0 from LOADING to FULL, Loading Done
R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.4.0/24 is directly connected, FastEthernet0/0
O    192.168.5.0/24 [110/138] via 192.168.2.2, 00:00:44, Serial0/0
O    192.168.1.0/24 [110/74] via 192.168.2.2, 00:00:44, Serial0/0
C    192.168.2.0/24 is directly connected, Serial0/0
O    192.168.3.0/24 [110/128] via 192.168.2.2, 00:00:44, Serial0/0
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#int s0/1
R1(config-if)#ip address 192.168.6.1 255.255.255.252
R1(config-if)#no shut
R1(config-if)#
*Mar  1 00:47:52.979: %LINK-3-UPDOWN: Interface Serial0/1, changed state to up
*Mar  1 00:47:53.979: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1, changed state to up
R1(config-if)#exit
R1(config)#exit
R1#wr
*Mar  1 00:48:00.619: %SYS-5-CONFIG_I: Configured from console by console
R1#wr
Building configuration...
[OK]
R1#
*Mar  1 00:48:22.623: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1, changed state to down
R1#
*Mar  1 00:49:52.623: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1, changed state to up
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router ospf 1
R1(config-router)#network 192.168.6.0 0.0.0.3 area 0
R1(config-router)#exit
R1(config)#exit
R1#
*Mar  1 00:53:27.123: %SYS-5-CONFIG_I: Configured from console by console
*Mar  1 00:53:28.039: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.5.1 on Serial0/1 from LOADING to FULL, Loading Done
R1#wr
Building configuration...
[OK]
R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.4.0/24 is directly connected, FastEthernet0/0
O    192.168.5.0/24 [110/74] via 192.168.6.2, 00:00:31, Serial0/1
     192.168.6.0/30 is subnetted, 1 subnets
C       192.168.6.0 is directly connected, Serial0/1
O    192.168.1.0/24 [110/74] via 192.168.2.2, 00:00:31, Serial0/0
C    192.168.2.0/24 is directly connected, Serial0/0
O    192.168.3.0/24 [110/128] via 192.168.6.2, 00:00:31, Serial0/1
                    [110/128] via 192.168.2.2, 00:00:31, Serial0/0
R1#
---------------------------------------------------------------------------
PC1> ip dhcp
DDORA IP 192.168.4.2/24 GW 192.168.4.1

PC1> show ip

NAME        : PC1[1]
IP/MASK     : 192.168.4.2/24
GATEWAY     : 192.168.4.1
DNS         :
DHCP SERVER : 192.168.4.1
DHCP LEASE  : 86392, 86400/43200/75600
MAC         : 00:50:79:66:68:00
LPORT       : 10038
RHOST:PORT  : 127.0.0.1:10039
MTU:        : 1500

PC1> ping 192.168.5.3
192.168.5.3 icmp_seq=1 timeout
192.168.5.3 icmp_seq=2 timeout
84 bytes from 192.168.5.3 icmp_seq=3 ttl=61 time=105.397 ms
84 bytes from 192.168.5.3 icmp_seq=4 ttl=61 time=105.880 ms
84 bytes from 192.168.5.3 icmp_seq=5 ttl=61 time=105.526 ms

PC1> ping 192.168.1.2
192.168.1.2 icmp_seq=1 timeout
192.168.1.2 icmp_seq=2 timeout
84 bytes from 192.168.1.2 icmp_seq=3 ttl=62 time=61.128 ms
84 bytes from 192.168.1.2 icmp_seq=4 ttl=62 time=60.439 ms
84 bytes from 192.168.1.2 icmp_seq=5 ttl=62 time=75.112 ms

PC1> ping 192.168.5.2
192.168.5.2 icmp_seq=1 timeout
192.168.5.2 icmp_seq=2 timeout
84 bytes from 192.168.5.2 icmp_seq=3 ttl=62 time=91.075 ms
84 bytes from 192.168.5.2 icmp_seq=4 ttl=62 time=61.627 ms
84 bytes from 192.168.5.2 icmp_seq=5 ttl=62 time=75.929 ms

PC1>
----------------------------------------------------------
PC2> ip dhcp
DDORA IP 192.168.4.3/24 GW 192.168.4.1

PC2> show ip

NAME        : PC2[1]
IP/MASK     : 192.168.4.3/24
GATEWAY     : 192.168.4.1
DNS         :
DHCP SERVER : 192.168.4.1
DHCP LEASE  : 86391, 86400/43200/75600
MAC         : 00:50:79:66:68:01
LPORT       : 10036
RHOST:PORT  : 127.0.0.1:10037
MTU:        : 1500

PC2>
-----------------------------------------------------------
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#int f0/0
R3(config-if)#ip address 192.168.5.1 255.255.255.0
R3(config-if)#no shut
R3(config-if)#
*Mar  1 00:07:34.939: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:07:35.939: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R3(config-if)#exit
R3(config)#int s0/0
R3(config-if)#ip address 192.168.3.1 255.255.255.0
R3(config-if)#no shut
R3(config-if)#
*Mar  1 00:08:43.231: %LINK-3-UPDOWN: Interface Serial0/0, changed state to up
*Mar  1 00:08:44.231: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to up
R3(config-if)#exit
R3(config)#ip dhcp pool p5
R3(dhcp-config)#network 192.168.5.0 255.255.255.0
*Mar  1 00:09:12.595: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to down
R3(dhcp-config)#network 192.168.5.0 255.255.255.0
R3(dhcp-config)#default-router 192.168.5.1
R3(dhcp-config)#exit
R3(config)#exit
R3#
*Mar  1 00:10:02.767: %SYS-5-CONFIG_I: Configured from console by console
R3#wr
Building configuration...
[OK]
R3#
*Mar  1 00:16:02.595: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to up
R3#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.5.0/24 is directly connected, FastEthernet0/0
C    192.168.3.0/24 is directly connected, Serial0/0
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#router ospf 2
R3(config-router)#network 192.168.5.0 0.0.0.255 area 0
R3(config-router)#network 192.168.3.0 0.0.0.255 area 0
R3(config-router)#exit
R3(config)#exit
R3#
*Mar  1 00:30:41.995: %SYS-5-CONFIG_I: Configured from console by console
R3#wr
Building configuration...
[OK]
R3#
*Mar  1 00:32:56.731: %OSPF-5-ADJCHG: Process 2, Nbr 192.168.3.2 on Serial0/0 from LOADING to FULL, Loading Done
R3#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

O    192.168.4.0/24 [110/138] via 192.168.3.2, 00:01:35, Serial0/0
C    192.168.5.0/24 is directly connected, FastEthernet0/0
O    192.168.1.0/24 [110/74] via 192.168.3.2, 00:01:35, Serial0/0
O    192.168.2.0/24 [110/128] via 192.168.3.2, 00:01:35, Serial0/0
C    192.168.3.0/24 is directly connected, Serial0/0
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#int s0/1
R3(config-if)#ip address 192.168.6.2 255.255.255.252
R3(config-if)#no shut
R3(config-if)#
*Mar  1 00:49:43.159: %LINK-3-UPDOWN: Interface Serial0/1, changed state to up
*Mar  1 00:49:44.159: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1, changed state to up
R3(config-if)#exit
R3(config)#exit
R3#wr
*Mar  1 00:49:53.027: %SYS-5-CONFIG_I: Configured from console by console
R3#wr
Building configuration...
[OK]
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#router ospf 2
R3(config-router)#network 192.168.6.0 0.0.0.3 area 0
R3(config-router)#exit
R3(config)#exit
R3#
*Mar  1 00:51:51.087: %SYS-5-CONFIG_I: Configured from console by console
R3#wr
Building configuration...
[OK]
R3#
*Mar  1 00:53:27.971: %OSPF-5-ADJCHG: Process 2, Nbr 192.168.4.1 on Serial0/1 from LOADING to FULL, Loading Done
R3#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

O    192.168.4.0/24 [110/74] via 192.168.6.1, 00:00:50, Serial0/1
C    192.168.5.0/24 is directly connected, FastEthernet0/0
     192.168.6.0/30 is subnetted, 1 subnets
C       192.168.6.0 is directly connected, Serial0/1
O    192.168.1.0/24 [110/74] via 192.168.3.2, 00:00:50, Serial0/0
O    192.168.2.0/24 [110/128] via 192.168.6.1, 00:00:50, Serial0/1
                    [110/128] via 192.168.3.2, 00:00:50, Serial0/0
C    192.168.3.0/24 is directly connected, Serial0/0
R3#
------------------------------------------------------------------
PC5> ip dhcp
DDORA IP 192.168.5.2/24 GW 192.168.5.1

PC5> show ip

NAME        : PC5[1]
IP/MASK     : 192.168.5.2/24
GATEWAY     : 192.168.5.1
DNS         :
DHCP SERVER : 192.168.5.1
DHCP LEASE  : 86394, 86400/43200/75600
MAC         : 00:50:79:66:68:04
LPORT       : 10044
RHOST:PORT  : 127.0.0.1:10045
MTU:        : 1500

PC5>
-----------------------------------------------------------------
PC6> ip dhcp
DDORA IP 192.168.5.3/24 GW 192.168.5.1

PC6> show ip

NAME        : PC6[1]
IP/MASK     : 192.168.5.3/24
GATEWAY     : 192.168.5.1
DNS         :
DHCP SERVER : 192.168.5.1
DHCP LEASE  : 86395, 86400/43200/75600
MAC         : 00:50:79:66:68:05
LPORT       : 10046
RHOST:PORT  : 127.0.0.1:10047
MTU:        : 1500

PC6>
-----------------------------------------------------------------
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#int f0/0
R2(config-if)#ip address 192.168.1.1 255.255.255.0
R2(config-if)#no shut
R2(config-if)#
*Mar  1 00:13:16.275: %LINK-3-UPDOWN: Interface FastEthernet0/0, changed state to up
*Mar  1 00:13:17.275: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
R2(config-if)#exit
R2(config)#int s0/0
R2(config-if)#ip address 192.168.2.2 255.255.255.0
R2(config-if)#no shut
R2(config-if)#
*Mar  1 00:14:45.571: %LINK-3-UPDOWN: Interface Serial0/0, changed state to up
*Mar  1 00:14:46.571: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0, changed state to up
R2(config-if)#exit
R2(config)#int s0/1
R2(config-if)#ip address 192.168.3.2 255.255.255.0
R2(config-if)#no shut
R2(config-if)#
*Mar  1 00:15:44.335: %LINK-3-UPDOWN: Interface Serial0/1, changed state to up
*Mar  1 00:15:45.335: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/1, changed state to up
R2(config-if)#exit
R2(config)#ip dhcp pool p1
R2(dhcp-config)#network 192.168.1.0 255.255.255.0
R2(dhcp-config)#default-router 192.168.1.1
R2(dhcp-config)#exit
R2(config)#exit
R2#
*Mar  1 00:17:21.207: %SYS-5-CONFIG_I: Configured from console by console
R2#wr
Building configuration...
[OK]
R2#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

C    192.168.1.0/24 is directly connected, FastEthernet0/0
C    192.168.2.0/24 is directly connected, Serial0/0
C    192.168.3.0/24 is directly connected, Serial0/1
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router ospf 23
R2(config-router)#network 192.168.1.0 0.0.0.255 area 0
R2(config-router)#network 192.168.2.0 0.0.0.255 area 0
R2(config-router)#network 192.168.2.0 0.0.0.255 area 0
*Mar  1 00:32:40.711: %OSPF-5-ADJCHG: Process 23, Nbr 192.168.4.1 on Serial0/0 from LOADING to FULL, Loading Done
R2(config-router)#network 192.168.3.0 0.0.0.255 area 0
R2(config-router)#
*Mar  1 00:32:56.655: %OSPF-5-ADJCHG: Process 23, Nbr 192.168.5.1 on Serial0/1 from LOADING to FULL, Loading Done
R2(config-router)#exit
R2(config)#exit
R2#
*Mar  1 00:33:33.847: %SYS-5-CONFIG_I: Configured from console by console
R2#wr
Building configuration...
[OK]
R2#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

O    192.168.4.0/24 [110/74] via 192.168.2.1, 00:01:25, Serial0/0
O    192.168.5.0/24 [110/74] via 192.168.3.1, 00:01:25, Serial0/1
C    192.168.1.0/24 is directly connected, FastEthernet0/0
C    192.168.2.0/24 is directly connected, Serial0/0
C    192.168.3.0/24 is directly connected, Serial0/1
R2#
----------------------------------------------------------------------
PC3> ip dhcp
DDORA IP 192.168.1.2/24 GW 192.168.1.1

PC3> show ip

NAME        : PC3[1]
IP/MASK     : 192.168.1.2/24
GATEWAY     : 192.168.1.1
DNS         :
DHCP SERVER : 192.168.1.1
DHCP LEASE  : 86397, 86400/43200/75600
MAC         : 00:50:79:66:68:02
LPORT       : 10040
RHOST:PORT  : 127.0.0.1:10041
MTU:        : 1500

PC3>
-----------------------------------------------------------------------
PC4> ip dhcp
DDORA IP 192.168.1.3/24 GW 192.168.1.1

PC4> show ip

NAME        : PC4[1]
IP/MASK     : 192.168.1.3/24
GATEWAY     : 192.168.1.1
DNS         :
DHCP SERVER : 192.168.1.1
DHCP LEASE  : 86395, 86400/43200/75600
MAC         : 00:50:79:66:68:03
LPORT       : 10042
RHOST:PORT  : 127.0.0.1:10043
MTU:        : 1500

PC4>
-----------------------------------------------------------------------